Revit 2027 API
IFCParameterTemplate.IsInSessionTemplate Method
 Returns true if this is an in-session template.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsInSessionTemplate()
Public Function IsInSessionTemplate As Boolean
public:
bool IsInSessionTemplate()
member IsInSessionTemplate : unit -> bool
Return Value
Boolean
 Whether or not the template is in-session.
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace